{
  "_name_or_path": "allenai/scibert_scivocab_uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Accounting",
    "1": "Algebra",
    "10": "Condensed Matter",
    "11": "Cryptography & Security",
    "12": "Data Structures & Algorithms",
    "13": "Econometrics",
    "14": "Electrical & Electronic Engineering",
    "15": "Electrochemistry",
    "16": "Finance",
    "17": "Genetics & Molecular Biology",
    "18": "High Energy Physics",
    "19": "Immunology & Microbiology",
    "2": "Analysis",
    "20": "Industrial & Manufacturing Engineering",
    "21": "Inorganic Chemistry",
    "22": "Machine Learning",
    "23": "Management",
    "24": "Management Information Systems",
    "25": "Marketing",
    "26": "Mathematical Physics",
    "27": "Mechanical Engineering",
    "28": "Natural Language Processing",
    "29": "Neuroscience",
    "3": "Analytical Chemistry",
    "30": "Numerical Analysis",
    "31": "Oncology",
    "32": "Optimization & Control",
    "33": "Organic Chemistry",
    "34": "Pharmacology",
    "35": "Physical and Theoretical Chemistry",
    "36": "Probability",
    "37": "Quantum Physics",
    "38": "Relativity & Gravity",
    "39": "Robotics",
    "4": "Artificial Intelligence",
    "40": "Spectroscopy",
    "41": "Systems & Control",
    "5": "Astrophysics",
    "6": "Cardiology",
    "7": "Chemical Engineering",
    "8": "Civil & Structural Engineering",
    "9": "Combinatorics"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Accounting": 0,
    "Algebra": 1,
    "Analysis": 2,
    "Analytical Chemistry": 3,
    "Artificial Intelligence": 4,
    "Astrophysics": 5,
    "Cardiology": 6,
    "Chemical Engineering": 7,
    "Civil & Structural Engineering": 8,
    "Combinatorics": 9,
    "Condensed Matter": 10,
    "Cryptography & Security": 11,
    "Data Structures & Algorithms": 12,
    "Econometrics": 13,
    "Electrical & Electronic Engineering": 14,
    "Electrochemistry": 15,
    "Finance": 16,
    "Genetics & Molecular Biology": 17,
    "High Energy Physics": 18,
    "Immunology & Microbiology": 19,
    "Industrial & Manufacturing Engineering": 20,
    "Inorganic Chemistry": 21,
    "Machine Learning": 22,
    "Management": 23,
    "Management Information Systems": 24,
    "Marketing": 25,
    "Mathematical Physics": 26,
    "Mechanical Engineering": 27,
    "Natural Language Processing": 28,
    "Neuroscience": 29,
    "Numerical Analysis": 30,
    "Oncology": 31,
    "Optimization & Control": 32,
    "Organic Chemistry": 33,
    "Pharmacology": 34,
    "Physical and Theoretical Chemistry": 35,
    "Probability": 36,
    "Quantum Physics": 37,
    "Relativity & Gravity": 38,
    "Robotics": 39,
    "Spectroscopy": 40,
    "Systems & Control": 41
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.45.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31090
}
